app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users"  WHERE "email"."{:autofocus=>true, :placeholder=>""Email""}" = 'winnie@the.pooh' LIMIT 1
SELECT "recommendations".* FROM "recommendations"  WHERE "recommendations"."recFor_id" = 2
---
  def login
  	@user = User.find_by_email(params[:email])
    if @user && @user.authenticate(params[:password])
      session[:user_id] = @user.id
    else
      if request.xhr?
        render :json => {message: "fail"}
      else
        redirect_to root_path
      end
    end

    if request.xhr?
      p "login xhr"
    	render :json => Recommendation.where(recFor: @user).to_json(:include => [:restaurant, :recBy])