app/controllers/welcome_controller.rb

  def index
  	if signed_in?
  		@recommendations = Recommendation.where(recFor: current_user)
---
SELECT "recommendations".* FROM "recommendations"  WHERE "recommendations"."recFor_id" = 3