app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'susie@bob.com' LIMIT 1
SELECT  1 AS one FROM "users"  WHERE "users"."email" = 'winnie@the.pooh' LIMIT 1
SELECT  1 AS one FROM "friends"  WHERE "friends"."user2" = 6 AND "friends"."user1" = 1 LIMIT 1
INSERT INTO "friends" ("accepted", "created_at", "updated_at", "user1", "user2") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["accepted", "f"], ["created_at", "2014-09-19 22:03:36.943924"], ["updated_at", "2014-09-19 22:03:36.943924"], ["user1", 3], ["user2", 2]]
---
  def friend_request
    if User.exists?(email: params[:email])
      user = User.find_by(email: params[:email])
      if Friend.exists?(user1: current_user, user2: user) || Friend.exists?(user2: current_user, user1: user)
        if request.xhr?
        render :json => {status: 500, message: "You're already foodie friends!"}
        end
      elsif user == current_user
        if request.xhr?
        render :json => {status: 500, message: "Hey. That's you!"}
        end
      else
        Friend.create(user1: current_user, user2: user, accepted: false)

SELECT  "friends".* FROM "friends"  WHERE "friends"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "friends" SET "accepted" = $1, "updated_at" = $2 WHERE "friends"."id" = 2  [["accepted", "t"], ["updated_at", "2014-09-19 22:52:18.955396"]]
---
  def accept_request
    friend = Friend.find(params[:id])
    if params[:response] == "true"
      friend.update(accepted: true)

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."name" = 'The Purple Pig' LIMIT 1
SELECT  1 AS one FROM "restaurants"  WHERE "restaurants"."name" = 'The Purple Pig' LIMIT 1
INSERT INTO "restaurants" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-09-19 03:59:45.790681"], ["name", "The Purple Pig"], ["updated_at", "2014-09-19 03:59:45.790681"]]
SELECT  "friends".* FROM "friends"  WHERE "friends"."email" = 'bob@bob.com' LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'bob@bob.com' LIMIT 1
INSERT INTO "recommendations" ("created_at", "recBy_id", "recFor_id", "restaurant_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-09-19 04:01:40.660198"], ["recBy_id", 2], ["recFor_id", 1], ["restaurant_id", 2], ["updated_at", "2014-09-19 04:01:40.660198"]]
---
  def recommend
    # create recommendation
    p params
    if Restaurant.exists?(:name => params[:restaurant][:name])
      restaurant = Restaurant.find_by(name: params[:restaurant][:name]);
    else
      restaurant = Restaurant.create(name: params[:restaurant][:name])
    end

    friend = User.find_by(email: params[:friend][:email]);
    Recommendation.create(restaurant: restaurant, recBy: current_user, recFor: friend)